Revit 2026 API

# GradientGradientNoiseAmount Property

---

The property labeled "Amount" from the "Gradient" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GradientNoiseAmount { get; }
```
```vb
Public Shared ReadOnly Property GradientNoiseAmount As String
	Get
```
```cpp
public:
static property String^ GradientNoiseAmount {
	String^ get ();
}
```
```fsharp
static member GradientNoiseAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Gradient Class

Autodesk.Revit.DB.Visual Namespace